//ТЕМА: Classes.Properties
//Завдання 1:
//Розробити клас «Freezer», який описує морозильну камеру з дотриманням наступних вимог:
//1.Реалізувати не менше п'яти закритих полів (різних типів), 
//що представляють основні характеристики класу. 
//2. Створити не менше двох статичних полів (різних типів), що представляють спільні характеристики 
//об'єктів даного класу.
//3. Створити статичний конструктор для ініціалізації статичних полів.
//4. Обов'язковою вимогою є реалізація декількох перевантажених конструкторів, аргументи яких визначаються студентом, виходячи із специфіки реалізованого класу і так само реалізація конструктора за замовчуванням. По можливості застосувати делегування конструкторів. 
//5. Перевизначити алгоритм методу ToString(), //який буде повертати інформацію про об’єкт у вигляді рядка. 
//6. Перенести описи всіх методів в інший файл, використовуючи partial class. 
//7.Створити масив(не менше 5 елементів) об'єктів створеного класу та показати інформацію по кожному.
using _04_01_IntroOOP_Classwork;
using System;

class Program
{
    static void Main()
    {
        Console.OutputEncoding = System.Text.Encoding.UTF8;
        Console.InputEncoding = System.Text.Encoding.UTF8;
        Freezer[] freezers = new Freezer[]
        {
            new Freezer("Samsung Frost", 250,-20,true,"A+"),
            new Freezer("Lg Ice", 280, -18, false,"A"),
            new Freezer("Bosch",300,-22,true,"A++"),
            new Freezer("Whirpool", 220,-19,false,"B"),
            new Freezer()
        };

        foreach (var freezer in freezers)
        {
            Console.WriteLine(freezer);
        }
        Console.WriteLine($"Загальна кількість морозильних камер: {Freezer.GetTotalFreezers()}");
    }
}